In [1]:
import pandas as pd
import numpy as np

print(f'pandas version:{pd.__version__}')
print(f'numpy version:{np.__version__}')

pandas version:1.4.1
numpy version:1.22.3

## 01 Series


https://pandas.pydata.org/docs/reference/api/pandas.Series.html

### 通过 list 创建 series

In [2]:
s1 = pd.Series([1,2,3])
s1

0    1
1    2
2    3
dtype: int64

In [3]:
s2 = pd.Series([1,2,3],index=['a','b','c'])
s2

a    1
b    2
c    3
dtype: int64

In [4]:
s3 = pd.Series(
    [1,2,3],
    index=['a','b','c'],
    name='hello'
    )
s3

a    1
b    2
c    3
Name: hello, dtype: int64

In [5]:
s3.name

'hello'

### 通过字典创建 series

In [6]:
# 字典中的 key 为 series 的索引， 
d1 = {'a':1,'b':2,'c':3}
s4 = pd.Series(d1)
s4

a    1
b    2
c    3
dtype: int64

### 通过 ndarray 来创建 series

In [7]:
np.random.seed(0)
s = pd.Series(np.random.randint(5,size=3))
s

0    4
1    0
2    3
dtype: int64

### 通过标量值来创建 series

In [8]:
s = pd.Series(
    1,
    index=['a','b','c']
    )
s

a    1
b    1
c    1
dtype: int64

### 创建空的 series

In [9]:
s = pd.Series()
s

<ipython-input-9-85850638a114>:1: FutureWarning: The default dtype for empty Series will be 'object' instead of 'float64' in a future version. Specify a dtype explicitly to silence this warning.
  s = pd.Series()

Series([], dtype: float64)

## 02 DataFrame

https://pandas.pydata.org/docs/reference/frame.html

### 创建空的 dataframe

In [10]:
df = pd.DataFrame()
print(df)

Empty DataFrame
Columns: []
Index: []

### 从 ndarray 创建 DataFrame

In [11]:
np.random.seed(0)
arr = np.random.randint(10,size=[5,3])
df = pd.DataFrame(arr,columns=list('abc'))
df

   a  b  c
0  5  0  3
1  3  7  9
2  3  5  2
3  4  7  6
4  8  8  1

In [12]:
# from_records
arr = np.array(
    [
        ("Lemon", "长沙", 80, 90),
        ("Jack", "上海", 90, 75),
        ("Peter", "深圳", 60, 80),
    ]
)
df = pd.DataFrame.from_records(
    arr, 
    columns=["name", "city", "math", "chem"]
    )
df

    name city math chem
0  Lemon   长沙   80   90
1   Jack   上海   90   75
2  Peter   深圳   60   80

In [13]:
arr = np.array(
    [
        ("Lemon", "长沙", 80, 90),
        ("Jack", "上海", 90, 75),
        ("Peter", "深圳", 60, 80),
    ]
)
df = pd.DataFrame(
    arr, 
    columns=["name", "city", "math", "chem"]
    )
df

    name city math chem
0  Lemon   长沙   80   90
1   Jack   上海   90   75
2  Peter   深圳   60   80

### 从列表创建 dataframe

In [14]:
# list，一维列表
lst = [1,2,3,5]
df = pd.DataFrame(lst)
df

   0
0  1
1  2
2  3
3  5

In [15]:
type(df)

pandas.core.frame.DataFrame

In [16]:
# list of list，二维列表
lst = [
    ["Lemon", "长沙", 80, 90],
    ["Jack", "上海", 90, 75],
    ["Peter", "深圳", 60, 80],
]
df = pd.DataFrame(
    data=lst, 
    columns=["name", "city", "math", "chem"]
    )
df

    name city  math  chem
0  Lemon   长沙    80    90
1   Jack   上海    90    75
2  Peter   深圳    60    80

In [17]:
# list of dict，二维列表,demo1
lst = [
    {'name':'Lemon','city':"长沙",
    'math':80,'chem':90},
    {'name':'Jack','city':"上海",
    'math':90,'chem':75},
    {'name':'Peter','city':"深圳",
    'math':60,'chem':80},
]
df = pd.DataFrame(data=lst)
df

    name city  math  chem
0  Lemon   长沙    80    90
1   Jack   上海    90    75
2  Peter   深圳    60    80

In [18]:
# list of dict，二维列表,demo2
lst = [
    {'name':'Lemon','city':"长沙",'math':80,'chem':90},
    {'name':'Jack','city':"上海",'math':90,'chem':75},
    {'name':'Peter','city':"深圳",'math':60},
]
df = pd.DataFrame(data=lst)
df

    name city  math  chem
0  Lemon   长沙    80  90.0
1   Jack   上海    90  75.0
2  Peter   深圳    60   NaN

In [19]:
# list of dict，二维列表,demo3
lst = [
    {'name':'Lemon','city':"长沙",'math':80,'chem':90},
    {'name':'Jack','city':"上海",'math':90,'chem':75},
    {'name':'Peter','city':"深圳",'math':60},
]
df = pd.DataFrame(data=lst,columns=['name','city','math'])
df

    name city  math
0  Lemon   长沙    80
1   Jack   上海    90
2  Peter   深圳    60

In [20]:
# list of dict，二维列表,demo4
lst = [
    {'name':'Lemon','city':"长沙",'math':80,'chem':90},
    {'name':'Jack','city':"上海",'math':90,'chem':75},
    {'name':'Peter','city':"深圳",'math':60},
]
df = pd.DataFrame(data=lst,columns=['name','city','math','化学'])
df

    name city  math  化学
0  Lemon   长沙    80 NaN
1   Jack   上海    90 NaN
2  Peter   深圳    60 NaN

In [21]:
# list of tuple，二维列表
lst = [
    ("Lemon", "长沙", 80, 90),
    ("Jack", "上海", 90, 75),
    ("Peter", "深圳", 60, 80),
]
df = pd.DataFrame(
    data=lst, 
    columns=["name", "city", "math", "chem"]
    )
df

    name city  math  chem
0  Lemon   长沙    80    90
1   Jack   上海    90    75
2  Peter   深圳    60    80

In [22]:
# list of tuple，二维列表
lst1 = ["Lemon","Jack","Peter"]
lst2 = ["长沙","上海","深圳"]
lst3 = [80,90,60]
lst4 = [90,75,80]
lst = list(zip(lst1,lst2,lst3,lst4))
print(lst)
df = pd.DataFrame(
    data=lst, 
    columns=["name", "city", "math", "chem"]
    )
df

[('Lemon', '长沙', 80, 90), ('Jack', '上海', 90, 75), ('Peter', '深圳', 60, 80)]

    name city  math  chem
0  Lemon   长沙    80    90
1   Jack   上海    90    75
2  Peter   深圳    60    80

### 从字典创建dataframe

In [23]:
d = {
    "name": [ "Lemon", "Jack", "Peter"],
    "city": ["长沙", "上海", "深圳"],
    "math": [80, 90, 60],
    "chem": [90, 75, 80],
}
df = pd.DataFrame(d)
df

    name city  math  chem
0  Lemon   长沙    80    90
1   Jack   上海    90    75
2  Peter   深圳    60    80

In [24]:
df = pd.DataFrame.from_dict(d)
df

    name city  math  chem
0  Lemon   长沙    80    90
1   Jack   上海    90    75
2  Peter   深圳    60    80

In [25]:
d = {
    "name": {0: "Lemon", 1: "Jack", 2: "Peter"},
    "city": {0: "长沙", 1: "上海", 2: "深圳"},
    "math": {0: 80, 1: 90, 2: 60},
    "chem": {0: 90, 1: 75, 2: 80},
}
df = pd.DataFrame(d)
df

    name city  math  chem
0  Lemon   长沙    80    90
1   Jack   上海    90    75
2  Peter   深圳    60    80

### 通过标量创建 DataFrame

In [26]:
df = pd.DataFrame(
    1,
    index=[1,2,3,4],
    columns=list('abcde')
    )
df

   a  b  c  d  e
1  1  1  1  1  1
2  1  1  1  1  1
3  1  1  1  1  1
4  1  1  1  1  1

## 03 通过读取文件来创建dataframe

此外， Sereis 和 DataFrame 均可以通过读取 csv、excel等数据文件来创建，这部分内容后续介绍

## 04《图解Pandas》专题汇总

《图解Pandas》系列已发布的图文汇总如下：

- [图文00-《图解Pandas》内容框架介绍](https://mp.weixin.qq.com/s/gh063BUAM90vFhy6ZLaznw)
- [图文01-数据结构介绍](https://mp.weixin.qq.com/s/H9kJf9zJU7ys6esr0DBhHg)

考虑到《图解Pandas》系列内容在不断更新过程中，大家可以通过下面的专题来找到最新发布的内容。

[![](https://tva1.sinaimg.cn/large/e6c9d24egy1h01f6wflmkj20go05kjrh.jpg)](https://mp.weixin.qq.com/mp/appmsgalbum?__biz=MzI2NjY5NzI0NA==&action=getalbum&album_id=2293754972943122444#wechat_redirect)

同时考虑到，以后如果文章数量较多（比如超过50篇文章），可能在专题中也不好快速的找到所需要的内容，我会以文章汇总的形式，将《图解Pandas》系列的文章进行手动汇总，并形成 `图解Pandas汇总` 的专题，最新的汇总文章，可以点击下面专题，找到最新的文章即可。

[![](https://tva1.sinaimg.cn/large/e6c9d24egy1h01f6yjzssj20go05kweo.jpg)](https://mp.weixin.qq.com/mp/appmsgalbum?__biz=MzI2NjY5NzI0NA==&action=getalbum&album_id=2293756873331933190#wechat_redirect)